Autodesk.Revit.DB.Structure.RebarShapeConstraintSegmentLength.GetSegmentEndReferenceType(System.Int32)
Choice of two possibilities for the start and end references of the length constraint.
index:
Which reference on the constraint. Either 0 or 1.
Throws Autodesk.Revit.Exceptions.ArgumentException:
index is not 0 or 1.
Since:
2012

Autodesk.Revit.DB.Structure.RebarShapeConstraintSegmentLength.#ctor(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Structure.RebarShapeSegmentEndReferenceType,Autodesk.Revit.DB.Structure.RebarShapeSegmentEndReferenceType)
Create a segment length constraint.
paramId:
The Id of a Rebar Shape parameter.
refType0:
Choose between two possibilities for the first reference of the length constraint.
refType1:
Choose between two possibilities for the second reference of the length constraint.
Throws Autodesk.Revit.Exceptions.ArgumentException:
paramId is not a valid Element identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Structure.RebarShapeConstraintSegmentLength
A constraint that controls the length of a segment.
Remarks:
The constraint has two references, indexed by 0 and 1, that do not have to
correspond to the start and end of the segment.
Since:
2012